#!/usr/bin/env ruby -w
# encoding: UTF-8
需要 'K图表'
class K折线图 < K图表
  def initialize(父界面 = nil, 宽 = 600, 高 = 400, p = 1.0/20)
    super(父界面, 宽, 高)
    @距离边框比例 = p
    @起点, @表宽, @表高 = 点(@宽*p, @高*p), @宽*(1-3*p), @高*(1-3*p)
  end
  def 绘制横坐标(横坐标范围, 刻度数量 = 10, 刻度长 = 5)
    线段(@起点, @起点.x变动(@表宽 + @宽*(1*@距离边框比例))).实例化.箭头
    表间距, 标度间距 = @表宽 / 刻度数量, 横坐标范围.差值 / 刻度数量
    0.至(刻度数量) do |间距数|
      刻度点 = @起点.x变动(表间距 * 间距数)
      线段(刻度点, 刻度点.y变动(刻度长)).实例化
      文本(刻度点.y变动(-10), 横坐标范围.起点 + 标度间距 * 间距数)
    end
  end
  def 绘制纵坐标(纵坐标范围, 刻度数量 = 8, 刻度长 = 5)
    线段(@起点, @起点.y变动(@表高 + @高*(1*@距离边框比例))).实例化.箭头
    表间距, 标度间距 = @表高 / 刻度数量, 纵坐标范围.差值 / 刻度数量
    0.至(刻度数量) do |间距数|
      刻度点 = @起点.y变动(表间距 * 间距数)
      线段(刻度点, 刻度点.x变动(刻度长)).实例化
      文本(刻度点.x变动(-15), 纵坐标范围.起点 + 标度间距 * 间距数)
    end
  end
end
