#!/usr/bin/env ruby -w
# encoding: UTF-8
class K单象限坐标图 < K图表
  def 初始化(父界面 = nil, 宽 = 600, 高 = 400, p = 1.5/20)
    super(父界面, 宽, 高, true)
    @p, @起点, @表宽, @表高 = p, 点(@宽*p, @高*2*p), @宽*(1-3*p), @高*(1-4*p)
  end
  def 设置坐标范围(横坐标范围, 纵坐标范围)
    @横坐标范围, @纵坐标范围 = 横坐标范围, 纵坐标范围
    计算纵横比例
  end
  def 计算纵横比例;@横比例, @纵比例 = @表宽.浮点化 / @横坐标范围.差值, @表高.浮点化 / @纵坐标范围.差值 end
  def 绘制横坐标(刻度数量 = 10, 刻度长 = 5)
    线段(@起点, @起点.x变动(@表宽 + @宽*(1*@p))).箭头
    表间距, 标度间距 = @表宽 / 刻度数量, @横坐标范围.差值 / 刻度数量.浮点化
    0.至(刻度数量) do |间距数|
      刻度点 = @起点.x变动(表间距 * 间距数)
      线段(刻度点, 刻度点.y变动(刻度长))
      文本(刻度点.y变动(-10), "%.2f" % (@横坐标范围.起点 + 标度间距 * 间距数))
    end
  end
  def 绘制纵坐标(刻度数量 = 8, 刻度长 = 5)
    线段(@起点, @起点.y变动(@表高 + @高*(1*@p))).箭头
    表间距, 标度间距 = @表高 / 刻度数量, @纵坐标范围.差值 / 刻度数量.浮点化
    0.至(刻度数量) do |间距数|
      刻度点 = @起点.y变动(表间距 * 间距数)
      线段(刻度点, 刻度点.x变动(刻度长))
      文本(刻度点.x变动(-15), "%.2f" % (@纵坐标范围.起点 + 标度间距 * 间距数))
    end
  end
  def 绘制显示内容
    自动设置坐标范围 if (@横坐标范围 == nil || @纵坐标范围 == nil)
    绘制横坐标
    绘制纵坐标
  end
end
