#!/usr/bin/env ruby -w
# encoding: UTF-8
需要 'Win32接口'
module S消息框
  @弹出消息框 = Win32接口.新建("MessageBox", 'PPPI', 'I', "user32")
  @类型哈希 = {确定: 0, 确定_取消: 1, 中止_重试_忽略: 2, 是_否_取消: 3, 是_否: 4, 重试_取消: 5, 取消_重试_继续: 6}
  @图标哈希 = {无: 0, 停止: 1, 问号: 2, 惊叹号: 3, 提示: 4}
  @返回值哈希 = {1 => :确定, 2 => :取消, 3 => :中止, 4 => :重试, 5 => :忽略, 6 => :是, 7 => :否}
  def self.显示(内容, 标题 = '', 类型 = :确定, 图标 = :无, 模态 = true, 默认选中 = 0)
    位标志 = @类型哈希[类型]
    位标志 += @图标哈希[图标] * 16
    位标志 += 默认选中 * 256
    位标志 += 1 * 4096 if 模态
    @返回值哈希[@弹出消息框.请求(0, 内容.编码为('GBK'), 标题.编码为('GBK'), 位标志)]
  end
end
