#!/usr/bin/env ruby -w
# encoding: UTF-8
class D矩形区域
  可读属性 :低点, :高点
  def 初始化(低点, 高点);@低点, @高点 = 低点, 高点 end
  def 长; 高点.x - 低点.x end
  def 宽; 高点.y - 低点.y end
  def 等于?(矩形区域);@低点.等于?(矩形区域.低点) && @高点.等于?(矩形区域.高点) end
  def 相交?(矩形区域);@低点.全小于?(矩形区域.高点) && @高点.全大于?(矩形区域.低点) end
  def 包围?(矩形区域);@低点.全小于?(矩形区域.低点) && @高点.全大于?(矩形区域.高点) end
  def 相交区域(矩形区域);相交?(矩形区域) ? 类.新建(@低点.取高(矩形区域.低点), @高点.取低(矩形区域.高点)) : nil end
  def 包围区域(矩形区域);类.新建(@低点.取低(矩形区域.低点), @高点.取高(矩形区域.高点)) end
  def 位移(向量);类.新建(@低点.位移(向量), @高点.位移(向量)) end
  def 字符串; "[#{@低点.字符串}, #{@高点.字符串}]" end
end